12-rails-forms-REST/app/controllers/doctors_controller.rb

INSERT INTO "doctors" ("name", "specialty", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Doctor Harris Bonkers"], ["specialty", "Dermatology"], ["created_at", "2019-07-22 15:22:07.638449"], ["updated_at", "2019-07-22 15:22:07.638449"]]
---
  def create
    @doctor = Doctor.new(doctor_params)
    if @doctor.save

UPDATE "doctors" SET "name" = ?, "specialty" = ?, "updated_at" = ? WHERE "doctors"."id" = ?  [["name", ""], ["specialty", "Pediatric Medicine"], ["updated_at", "2019-07-22 15:35:04.284360"], ["id", 1]]
---
  def update
    @doctor.update(doctor_params)

SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_doctor
    @doctor = Doctor.find(params[:id])